#include <iostream>
using namespace std;

/*
	Тип		Размер в байтах		Пояснение											Диапазон значений

	float	4					описывает вещественные числа одинарной точности
	double	8					описывает вещественные числа двойной точности

	int		4					описывает целые числа								от -2147483648 до 2147483647
	short	2					описывает короткие целые числа						от -32768 до 32767
	long	4					описывает длинные целые числа						от -2147483648 до 2147483647

	char	1					описывает символы

	bool	1					описывает логические значения
*/

int main() {}
