#include <iostream>
using namespace std;

void main()
{
    setlocale(LC_ALL, "Rus");

    // Урок #8. Операторы. Арифметические операции с числами. --------------------------------------------------------------------------------------------------------------------------

    int a = 5;

    cout << a << endl;

    a = -a;

    cout << a << endl;

    int b = 5, c = 2, d, e, f;

    d = b + c;
    e = 2 + 2 * 2;
    f = (2 + 2) * 2;

    cout << d << endl;
    cout << a * b << endl;
    cout << e << endl;
    cout << f << endl;


    // Урок #7. Ввод данных. Cin. Пример. Синтаксис. -----------------------------------------------------------------------------------------------------------------------------------

    /*
    
    int Var, Var2, Var3, Var4;

    cout << "Введите первое число: ";
    cin >> Var;

    cout << "Введите второе число: ";
    cin >> Var2;

    cout << "Число 1 = " << Var << endl << "Число 2 = " << Var2 << endl;

    cout << "Введите два числа: ";
    cin >> Var3 >> Var4;

    cout << "Число 3 = " << Var3 << endl << "Число 4 = " << Var4 << endl;
    
    */


    // Урок #6. Константы. Ключевое слово const. ---------------------------------------------------------------------------------------------------------------------------------------
    
    /*
    
    const int COUNT_DAYS_IN_WEEK = 7;

    const char NEW_LINE = '\n';
    const char TAB = '\t';

    cout << TAB << TAB << COUNT_DAYS_IN_WEEK << NEW_LINE;

    */


    // Урок #5. Переменные. Способы объявления. Правила наименования. ------------------------------------------------------------------------------------------------------------------

    /*
    
    Переменная - это область оперативной памяти, обладающая собственным именем и предназначенная для хранения данных разных типов, которые могут быть изменены.

    int a;
	a = 5;

	int b = 7;

	cout << a << endl;
	cout << b << endl;

	a = 10;

	cout << a << endl;

	int Age, c, d, e = 6565;

	Age = 10;
	c = 1;
	d = 2;

	cout << Age << " " << c << " " << d << " " << e << endl;

	double f = 1.1551;
	char g = 'g';

	cout << f << " " << g << endl;

	bool h = true;
	bool i = false;

	cout << h << " " << i << endl;

    */
}
